Revit 2026 API

# CableTypeCoreType Property

---

The core type of the cable type.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CoreType CoreType { get; set; }
```
```vb
Public Property CoreType As CoreType
	Get
	Set
```
```cpp
public:
property CoreType CoreType {
	CoreType get ();
	void set (CoreType value);
}
```
```fsharp
member CoreType : CoreType with get, set
```

#### Property Value

CoreType

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

It is single core by default.

#### Reference

CableType Class

Autodesk.Revit.DB.Electrical Namespace